In [2]:
import csv
import pandas as pd

In [3]:
df = pd.read_csv("NationalNames.csv")

In [4]:
df.head()

   Id       Name  Year Gender  Count
0   1       Mary  1880      F   7065
1   2       Anna  1880      F   2604
2   3       Emma  1880      F   2003
3   4  Elizabeth  1880      F   1939
4   5     Minnie  1880      F   1746

In [7]:
df.shape

(1825433, 5)

In [8]:
df.tail()

              Id     Name  Year Gender  Count
1825428  1825429   Zykeem  2014      M      5
1825429  1825430   Zymeer  2014      M      5
1825430  1825431  Zymiere  2014      M      5
1825431  1825432    Zyran  2014      M      5
1825432  1825433    Zyrin  2014      M      5

In [39]:
male_list = []
for index, row in df.iterrows():
    if row['Gender'] == 'M':
        male_list.append(row['Name'])

Wall time: 0 ns

In [40]:
len(male_list)

743750

In [41]:
female_list = []
for index, row in df.iterrows():
    if row['Gender'] == 'F':
        female_list.append(row['Name'])

In [42]:
len(female_list)

1081683

In [43]:
with open('male.txt', 'w') as f:
    for item in male_list:
        f.write("%s\n" % item)

In [44]:
with open('female.txt', 'w') as f:
    for item in female_list:
        f.write("%s\n" % item)